Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: མི་ཡི་རབ་མཆོག་དག་གི་དམ་ཆོས་རྣམས། །ལོ་གྲངས་ཉི་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this supreme human Will remain for twenty-one thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཟང་པོའི་གྲངས། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་རྩ་གསུམ་འབྱུང་། །
en: His relics will be abundant, and the fine stūpas Will number three hundred thirty million.

source: རྒྱལ་བ་བདུད་དག་འདུལ་བར་མཛད་པ་པོའི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱ། །
en: “The victorious Māradama Will be born in a place called Endowed with Merit.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་བརྒྱ་ཁྱབ་གྱུར་ཕལ་ཆེན་ཡབ། །འོད་ཀྱི་ཚོགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend five hundred leagues. “Vast will be his father and Gathering of Light will be this victor’s mother.

source: སྲས་པོ་དེས་ལྡན་ཆུ་ལྷ་རིམ་གྲོ་པ། །
en: Gentle will be his son and Water God his attendant.

source: ཡེ་ཤེས་འོད་མཆོག་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: Supreme Light of Wisdom will be the scholar

source: དོན་ལ་རྣམ་པར་ངེས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Ascertainer of the Meaning the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཅུ་སྟེ། །ཆགས་མེད་ཡིད་ལྡན་དེ་དག་ཐམས་ཅད་གྲངས། །ཐེར་འབུམ་ཕྲག་གཉིས་སྙེད་ནི་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering two billion Whose minds have achieved detachment.

source: གྲགས་པ་མཐའ་ཡས་དག་གི་དམ་ཆོས་རྣམས། །ལོ་གྲངས་བཞི་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this teacher of infinite fame Will remain for forty-six thousand years.

source: སྐུ་གདུང་བཅས་པའི་མཆོད་རྟེན་བཟང་པོ་དག །འཇིག་རྟེན་དག་ཏུ་ཐེར་འབུམ་ཕྲག་གཉིས་འབྱུང་། །
en: The fine stūpas containing his relics in the world Will number two billion.

source: དེ་བཞིན་གཤེགས་པ་གོ་ཆ་བགོས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བལྟ་ན་མཛེས་ཞེས་བྱ། །
en: “The thus-gone Kṛtavarman Will be born in a place called Beautiful to Behold.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བཞི་ཡབ་ནི་ལེགས་སྣང་ཡིན། །ངེས་བྱམས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-four leagues. Excellent Light will be his father and Certain Love will be this victor’s mother.

source: སྲས་པོ་གསེར་ཡིན་རྣམ་དག་རིམ་གྲོ་པ། །
en: Gold will be his son and Pure his attendant.

source: མེ་ཏོག་དགའ་ཞེས་བྱ་བ་བློ་ལྡན་ཏེ། །
en: Flower Joy will be the one with knowledge

source: གཟུགས་བརྩེགས་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Cluster of Forms the one of miracles.

source: འདུས་པ་ལན་གྲངས་བྱེ་བ་ཕྲག་བཞི་དང་། །གཞན་ཡང་དྲུག་ཅུ་རྩ་དྲུག་ཀུན་ལ་ཡང་། །བརྒྱད་ཁྲི་བརྒྱད་ཁྲི་དག་ནི་ཚོགས་པར་འགྱུར། །
en: “There will be forty million consecutive congregations, As well as sixty-six, Each of them gathering eighty thousand.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་ལྔ་སྟོང་ཡིན། །
en: The lifespan of humans will be seventy-five thousand years,

source: མགོན་པོ་མཆོག་མའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་ལྔ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this supreme protector Will remain for seventy-five thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཞི་པ་ཀུན། །གསེར་གྱི་འོད་ཀྱིས་རྣམ་པར་མཛེས་པར་བྱས། །
en: The stūpa of this victorious one will be four leagues large And beautifully adorned with golden light.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཕྱག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ངེས་པའི་དོན་ཞེས་བྱ། །
en: “The thus-gone Siṃhahasta Will be born in a place called Definitive Meaning.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་དྲུག་ཡབ་ནི་མི་དམན་པ། །བདུད་རྩི་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend seventy-six leagues. “Not Inferior will be his father and Nectar Joy will be this victor’s mother.

source: སྲས་པོ་ཆོས་བཟངས་ཕན་འདོད་རིམ་གྲོ་པ། །
en: Excellent Dharma will be his son and Wish to Benefit his attendant.

source: ངེས་པར་ཐོབ་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Decisive Attainment the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །ཐེག་པ་མཆོག་གིས་རྣམ་ཐར་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བཅུ་བཅུ་ཚོགས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering one hundred million Who have attained liberation through the supreme vehicle.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: The lifespan of humans will be sixty-two thousand years,

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་དགུ་བཅུ་རྩ་དགུར་གནས། །
en: “And after this knower of the world has attained nirvāṇa His sacred Dharma will remain for ninety-nine years.

source: དཔག་ཚད་ལྔ་པའི་མཆོད་རྟེན་སྐུ་གདུང་བཅས། །གཅིག་སྟེ་རིན་ཆེན་བརྒྱ་སྙེད་དྲ་བས་སྤྲས། །
en: The single stūpa containing his relics will be five leagues large And ornamented with hundreds of different jewels.

source: མི་ཡི་འདྲེན་པ་མེ་ཏོག་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་བརྒྱན་ཞེས་བྱ། །
en: “The guide of humans, Supuṣpa, Will be born in a place called Adorned with Flowers.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་མཆོད་ལེགས་ཡིན། །མེ་ཏོག་མཆོག་མ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །མེ་ཏོག་བཟང་པོ་མེ་ཏོག་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend five leagues. “Excellent Worship will be his father and Supreme Flower will be this victor’s mother. Excellent Flower will be his son and Flower his attendant.

source: གཟི་བརྗིད་མངོན་འཕགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Exalted Splendor the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །མཚུངས་མེད་བྱ་དང་མཚུངས་ཤིང་འདྲ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred ninety million Incomparable ones who soar like birds.

source: མཆོད་རྟེན་བཟང་པོ་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ། །གསེར་གྱི་འོད་དག་གིས་ནི་རྒྱས་པར་འགྱུར། །
en: There will be ten billion fine stūpas That shine with golden light.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཐོན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་ཚོགས་ཞེས་བྱ། །
en: “The thus-gone Ratnottama Will be born in a place called Jewel Gathering.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་རིན་ཆེན་བཟང་པོ་ཡབ། །དཔལ་རྒྱན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend six leagues. “Excellent Jewel will be his father and Glorious Ornament will be this victor’s mother.

source: སྲས་པོ་འཇིགས་མེད་དུལ་བ་རིམ་གྲོ་པ། །
en: Fearless will be his son and Trained his attendant.

source: སྟོན་པ་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Teacher the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །དགྲ་བཅོམ་དེ་དག་ཐམས་ཅད་བསམ་གཏན་པ། །ཐེར་འབུམ་ཕྲག་ནི་བཅུ་བཅུ་འབྱུང་བར་འགྱུར། །
en: “There will be thirty-six consecutive congregations, Each of them gathering ten billion Worthy masters of meditation.

source: རྒྱལ་བའི་སྐུ་ཚེ་ལོ་གྲངས་ཁྲི་ཡང་ཡིན། །
en: The lifespan of this victor will be ten thousand years,

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: “And after he has proceeded to cessation His sacred Dharma will remain for twenty-three thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་སྐུ་གདུང་བཅས་པ་གཅིག །དཔག་ཚད་གསུམ་པ་ཕྲེང་བ་མཛེས་པ་བཞིན། །
en: There will be a single stūpa containing the relics of this victor, Three leagues large and draped with beautiful garlands.

source: མགོན་པོ་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ཡི། །སྐྱེ་ཡུལ་མཐུ་རྩལ་སྙིང་པོ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone protector, Sāgara, Will be born in a place called Heart of Power.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཞི་ཡོད་ཡབ་ནི་ལྷ་དབང་ཡིན། །ཡོན་ཏན་རྒྱ་མཚོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend four leagues. “Divine King will be his father and Ocean of Qualities will be this victor’s mother.

source: སྲས་པོ་རྒྱ་མཚོ་ལེགས་དགའ་རིམ་གྲོ་པ། །
en: Ocean will be his son and Excellent Joy his attendant.

source: ཆུ་ཡི་རྒྱལ་པོ་ལྟ་བུ་བློ་ཅན་ཏེ། །
en: Like the King of Water will be the one of wisdom

source: བླ་མེད་ཐོབ་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Attainer of the Unsurpassable the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་མཚོ་ལྟར་གང་བའི་ཡིད་འདྲ་བ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering nine hundred twenty million Whose minds are like brimming lakes.

source: མི་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་དགུ་སྟོང་ཡིན། །
en: The lifespan of humans will be ninety-nine thousand years,

source: མཐའ་མེད་བརྙེས་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲི་ཚང་བའི་བར་དུ་གནས། །
en: “And the sacred Dharma of the discoverer of infinity Will remain complete for eighty thousand years.

source: རྒྱལ་བ་ཞི་བར་ཕྱིན་པའི་མཆོད་རྟེན་གྲངས། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་རྩ་གཉིས་འབྱུང་། །
en: The stūpas of the one gone to peace Will number two hundred twenty million.

source: མགོན་པོ་དེ་བཞིན་གཤེགས་པ་ས་འཛིན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ལེགས་པར་དུལ་ཞེས་བྱ། །
en: “The thus-gone protector, Dharaṇīdhara, Will be born in a place called Well Trained.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལེགས་བཟངས་ཡིན། །མཆོད་སྦྱིན་ཡོན་བརྒྱན་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Fine Excellence will be his father, and Adorned with the Qualities of Worship will be this victor’s mother.

source: སྲས་པོ་བྱམས་ལྡན་བློ་ལྡན་རིམ་གྲོ་པ། །
en: Loving will be his son and Intelligent his attendant.

source: ས་བདག་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Lord of the Land will be the scholar

source: གཟུངས་དགུ་ཐོབ་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Attainer of Nine Retentions the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །མཚུངས་པ་མེད་པ་པད་མའི་དངོས་ལྟ་བུའི། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering two hundred twenty million Incomparable, lotus-like beings.

source: ཡོན་ཏན་མངོན་པར་དགྱེས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་བདུན་བར་དུ་གནས། །
en: “And the sacred Dharma of truly delightful qualities Will remain complete for seventeen thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གཅིག་པ་སྟེ། །མེ་ཏོག་བརྒྱ་དག་གིས་ནི་བརྒྱན་ཞིང་སྤྲས། །
en: The stūpa of this victor will measure one league And be beautifully adorned with hundreds of flowers.

source: དེ་བཞིན་གཤེགས་པ་དོན་གྱི་བློ་མངའ་བའི། །སྐྱེ་བའི་ཡུལ་ནི་དོན་ལྡན་སྒྲ་ཞེས་བྱ། །
en: “The thus-gone Arthabuddhi Will be born in a place called Meaningful Sound.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ལག་བཟངས་ཡིན། །ཚངས་པའི་མཆོད་རྟེན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend nine leagues. “Excellent Hand will be his father and Brahmā Stūpa will be this victor’s mother.

source: སྲས་པོ་མཆོད་རྟེན་ལེགས་སེམས་རིམ་གྲོ་པ། །
en: Stūpa will be his son and Excellent Mind his attendant.

source: བློ་གྲོས་བདུད་རྩི་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Nectar of Intelligence will be the scholar

source: རྣམ་པར་ངེས་པའི་མཛོད་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Treasury of Certainty the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཁོང་ཁྲོ་མེད་པ་རི་ལྟར་གནས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred twenty million Mountain-like beings who are free from anger.

source: རྣམ་པར་ཐར་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་བརྒྱད་བར་དུ་གནས། །
en: “And when the teacher has entered liberation His sacred Dharma will remain for eighteen thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་ས་གཞི་ཐམས་ཅད་ནི། །རིན་ཆེན་མཆོད་རྟེན་བྱེ་བ་དྲུག་གིས་ཁྱབ། །
en: His relics will be abundant, and the entire earth Will be covered by sixty million precious stūpas.

source: དཔལ་ལྡན་ལེགས་པ་ཡོན་ཏན་བསགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་ངན་ཞེས་བྱ། །
en: “The good and glorious Guṇagaṇa Will be born in a place called Inferior Intelligence.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཅིག་ཡོད་ཡབ་ནི་བློ་ལྡན་ཡིན། །མི་སྡུག་རྒྱལ་བའི་ཡུམ་ཡིན་སྲས་པོ་ནི། །འཇིག་རྟེན་དགའ་བ་སྐར་མ་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend one league. “Intelligent will be his father and Unattractive will be this victor’s mother. Joy for the World will be his son and Star his attendant.

source: འགྲོས་སྙོམས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Even Mode will be the scholar

source: འོད་ཅན་གྲགས་པ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Famed Illuminator the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱ་ནི་རྩ་ལྔ་སྟེ། །བྱེ་བ་བརྒྱ་ཕྲག་དག་ནི་ཚང་བ་དང་། །དྲུག་ཅུ་རྩ་དྲུག་དག་ཀྱང་འདུས་པར་འགྱུར། །
en: “There will be one hundred and five consecutive congregations, Each of them gathering one billion, And then another sixty-six congregations.

source: ལྷ་མིའི་དོན་ཕྱིར་དམ་ཆོས་ལོ་སྟོང་དུ། །གནས་འགྱུར་སྐུ་གདུང་བཅས་པའི་མཆོད་རྟེན་ནི། །དཔག་ཚད་དགུ་བཅུ་རྩ་བརྒྱད་པ་གཅིག་སྟེ། །རིན་ཆེན་བརྒྱ་སྙེད་དྲ་བས་རྣམ་པར་སྤྲས། །
en: “And for the sake of gods and humans the sacred Dharma will remain for a thousand years. The single stūpa containing the relics Will measure ninety-eight leagues And be adorned with nets of hundreds of jewels.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཚོགས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་བརྒྱན་ཅེས་བྱ། །
en: “The thus-gone Guṇagaṇa Will be born in a place called Adorned with Qualities.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་རྒལ་བ་པོ། །ཡོན་ཏན་གཟི་བརྗིད་ལྡན་པ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend three leagues. “Traverser will be his father and Endowed with Splendid Qualities will be this victor’s mother.

source: སྲས་པོ་བློ་ལྡན་བློ་ཅན་རིམ་གྲོ་པ། །
en: Intelligent will be his son and Intelligent his attendant.

source: མི་དགའ་སྤོང་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Abandoning Displeasure will be the scholar

source: དྲ་བ་གཅོད་བྱེད་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Cutting through the Net the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཅིག་ཀུན་ལ་ཡང་། །ཆགས་པ་མེད་པ་བསམ་གཏན་པ་དེ་ཀུན། །བྱེ་བ་བརྒྱ་ཕྲག་དག་ནི་གསུམ་གསུམ་ཡོད། །
en: “There will be eleven consecutive congregations, Each of them gathering three billion, Masters of meditation who are free from attachment.

source: མི་ཚེའི་ཚད་ནི་ལོ་གྲངས་ཁྲི་ཡང་ཡིན། །
en: The lifespan of humans will be ten thousand years,

source: རྒྱལ་བའི་དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས། །
en: “And this victor’s sacred Dharma will remain for a thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་སྐུ་གདུང་བཅས་པ་ནི། །དཔག་ཚད་ཕྱེད་པའི་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །གདུགས་གྲངས་སྟོང་ཕྲག་བདུན་ཅུས་རྣམ་པར་བརྒྱན། །
en: The relics of this victorious one Will be contained in a single stūpa, Half a league large and adorned with seventy thousand parasols.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མེ་ཏོག་གི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་ལྡན་མཆོག་ཅེས་བྱ། །
en: “The thus-gone Ratnāgni Will be born in a place called Endowed with Supreme Intelligence.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །དྲུག་ཅུ་རྩ་གཉིས་ཚོགས་ཅན་དབང་པོ་ཡབ། །སེང་གེ་རྒྱལ་མཚན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend sixty-two leagues. “Lord of the Gathering will be his father and Lion Banner will be this victor’s mother.

source: སྲས་པོ་ཚོགས་ཅན་ཚོགས་བཟང་རིམ་གྲོ་པ། །
en: Gatherer will be his son and Excellent Gathering his attendant.

source: རི་ལྟར་བརྩེགས་ཞེས་བྱ་བ་བློ་ལྡན་ཏེ
en: Rising like a Mountain will be the one of insight

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཕྱིར་མི་ལྡོག་པ་གཟུངས་ནི་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་དྲུག་དྲུག་འདུས། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred sixty million, Irreversible ones who have attained retention.

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone to peace Will remain for thirty-two thousand years.

source: སྲིད་པ་ཐར་མཛད་པ་ཡི་མཆོད་རྟེན་གྲངས། །བརྒྱད་ཁྲི་བཞི་སྟོང་དག་ནི་འབྱུང་བར་འགྱུར། །
en: The stūpas of the one who has gone beyond existence Will number eighty-four thousand.

source: བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་འདས་པ་ཡི། །སྐྱེ་ཡུལ་བསོད་ནམས་ལེགས་པར་བསྒོམས་ཞེས་བྱ། །
en: “The well-gone Lokāntara Will be born in a place called Excellent Cultivation of Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་དྲུག་ཡབ་ནི་མུ་སྟེགས་བཟང་། །དོན་ལ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend thirty-six leagues. “Excellent Steps will be his father and Delighting in the Meaning will be this victor’s mother.

source: སྲས་པོ་དོན་ལྡན་དགའ་བ་རིམ་གྲོ་པ། །
en: Endowed with Meaning will be his son and Joy his attendant.

source: འཇིགས་མེད་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Fearless Joy will be the scholar

source: གྲགས་པ་མངོན་འཕགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Truly Superior Fame the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་དགུ་བཅུ་སྟེ། །རབ་མཆོག་དག་གི་ཚོགས་ཀྱི་གྲངས་རྣམས་ཀྱང་། །བྱེ་བ་ཕྲག་ནི་སྟོང་སྟོང་འབྱུང་བར་འགྱུར། །
en: “There will be ninety consecutive congregations, Each of them gathering ten billion Of the highest and supreme.

source: ཡོན་ཏན་ལྡན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma replete with qualities Will remain for seventy-four thousand years.

source: རིམས་ནད་མེད་པའི་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་བཞི། །
en: The relics of the one free from the plagues will be abundant And contained in seven hundred forty billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ཟླ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བ་ཅན་ཞེས་བྱ། །
en: “The thus-gone Lokacandra Will be born in a place called Possessor of the Moon.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ཟླ་བ་ཡིན། །ཟླ་བཞིན་མཛེས་མ་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཚེ་ལྡན་མེ་ཏོག་བཟང་པོ་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Moon will be his father and Lovely Moon Countenance his mother. Vitality will be his son and Excellent Flower his attendant.

source: རྣམ་པར་སྣང་བྱེད་གྲགས་པ་བློ་ལྡན་ཏེ། །
en: Famed Illuminator will be the scholar

source: ཚུལ་ཁྲིམས་འོད་བྱེད་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Discipline the one of miracles.

source: ཚོགས་ཀྱི་རྒྱལ་པོ་རབ་མཆོག་དམ་པ་ཡི། །འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་ལ། །བྱེ་བ་ཕྲག་ནི་བརྒྱ་རྩ་བཞི་བཞི་འདུས། །
en: “There will be sixty-six consecutive congregations Of the true and supreme king of gatherings, Each of them bringing together four billion.

source: སྐུ་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: His lifespan will be thirty-two thousand years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །དགུ་བཅུ་རྩ་ལྔའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma will remain For ninety-five thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་སྐུ་གདུང་བཅས་པ་ནི། །དཔག་ཚད་བདུན་པ་གཅིག་སྟེ་གསེར་གྱིས་བརྒྱན། །
en: The single stūpa containing the relics of the victorious one Will measure seven leagues and be adorned with gold.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་ནི་སྙན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཆོས་ཀྱི་ལྟ་ཞེས་བྱ། །
en: “The thus-gone Madhura­svara­rāja Will be born in a place called Dharma View.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་སྐུ་བཟངས་ཡིན། །བཟང་དཔལ་ཞེས་ནི་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend thirty leagues. “Excellent Body will be his father and Excellent Glory will be this victor’s mother.

source: སྲས་པོ་པད་མ་རྒྱལ་དགའ་རིམ་གྲོ་པ། །
en: Lotus will be his son and Victorious Joy his attendant.

source: ཡོན་ཏན་སྙིང་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Essence of Qualities will be the scholar

source: ཆོས་འཕགས་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Superior Dharma the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཞི་སྟེ་ཀུན་ལ་ཡང་། །ཞི་བ་གོམས་པར་བསྒོམས་པའི་ཡིད་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བདུན་བདུན་འདུས། །
en: “There will be four consecutive congregations, Each of them gathering seven hundred seventy million Who have mastered the cultivation of mental peace.

source: དངོས་པོ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉིས་འབུམ་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one who has gone beyond entities Will remain two hundred thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རྒྱས་འགྱུར་མཐའ་ཡས་ཤིང་། །མཆོད་རྟེན་བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ། །
en: The relics of this victorious one will be infinitely abundant, Residing in seven hundred thirty million stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཚངས་པས་ལྟ་ཞེས་བྱ། །
en: “The thus-gone BrahmaketuWill be born in a place called Seen by Brahmā.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །ཚངས་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend seventy-two leagues. “Excellent Brahmā will be his father and Brahmā Possessor will be this victor’s mother.

source: སྲས་པོ་ཚངས་པ་ཚངས་བཟངས་རིམ་གྲོ་པ། །
en: Brahmā will be his son and Excellent Brahmā his attendant.

source: བསམ་པ་སྙིང་རྗེ་ཅན་ནི་མཁས་པ་སྟེ། །
en: Compassionate Concern will be the scholar

source: བྱམས་ལ་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding by Love the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །ཆགས་པ་མེད་གྱུར་གཏི་མུག་མེད་པ་ཀུན། །བྱེ་བ་ཕྲག་ནི་བཅུ་གསུམ་བཅུ་གསུམ་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering one hundred thirty million Who are detached and free from dullness.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་འབུམ་ཡང་ཡིན། །
en: The lifespan of humans will be one hundred thousand years,

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཚང་བའི་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who has attained nirvāṇa Will remain complete for ninety thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་སྐུ་གདུང་བཅས་པ་ནི། །དཔག་ཚད་བཅུ་གཉིས་པ་གཅིག་གསེར་གྱིས་བརྒྱན། །
en: The single stūpa with the relics of this victorious one Will measure twelve leagues in height and be decorated with gold.

source: དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་གཙོ་བོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བརྟགས་པའི་བློ་ཞེས་བྱ། །
en: “The thus-gone Gaṇimukha Will be born in a place called Imagination.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ཟླ་བཟངས་ཡིན། །སེམས་སྙོམས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend nine leagues. “Excellent Moon will be his father and Equanimous Mind will be this victor’s mother.

source: སྲས་པོ་པད་མ་ལྗོན་པ་རིམ་གྲོ་པ། །
en: Lotus will be his son and Tree his attendant.

source: ཡོན་ཏན་དག་གིས་བརྩེ་བ་མཁས་པ་སྟེ། །
en: Love with Qualities will be the scholar

source: བླ་མ་སེམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Highest Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་ལྷག་མ་མེད་པ་རླུང་འདྲ་བ། །བྱེ་བ་ཕྲག་ནི་སྟོང་སྟོང་ཚང་བར་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering ten billion Who are beyond remainder and resemble the wind.

source: འདྲེན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་གསུམ་བར་དུ་གནས། །རིན་ཆེན་མཆོད་རྟེན་གྲངས་ནི་བྱེ་བ་ཕྲག །སྟོང་ཕྲག་ཆིག་བརྒྱ་རྩ་ནི་བཅུ་དག་འབྱུང་། །
en: “And when this guide has attained nirvāṇa His sacred Dharma will remain complete for thirteen thousand years. The precious stūpas with the relics of this victorious one Will number one trillion one hundred billion.

source: ཡོན་ཏན་བསགས་པ་སེང་གེའི་སྟབས་དག་གི། །སྐྱེ་ཡུལ་འཇིག་རྟེན་བླ་མ་དགྱེས་ཞེས་བྱ། །
en: “The accumulator of excellent qualities, Siṃhagati, Will be born in a place called World of Highest Delight.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །འཛམ་གླིང་གཉིས་ཁྱབ་ཡབ་ནི་ལེགས་གྲུབ་ཡིན། །དཀྱིལ་འཁོར་འགྲོ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twice as far as Jambudvīpa. “Excellent Accomplishment will be his father and Circular Movement will be this victor’s mother.

source: སྲས་པོ་ཡིད་འཛིན་ཡིད་འོང་རིམ་གྲོ་པ། །
en: Concentration will be his son and Delightful his attendant.

source: བརྟུལ་ཞུགས་གྲུབ་པ་ཤེས་རབ་ཅན་ཡིན་ཏེ། །
en: Accomplishment of Yogic Discipline will be the scholar

source: ང་རོའི་མཆོག་གྲུབ་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Accomplishment of the Supreme Roar the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཡིན་ཏེ། །དགྲ་བཅོམ་ཐེར་འབུམ་ཇི་སྙེད་ཡོད་པ་རྣམས། །གང་གཱའི་རྒྱུན་ལྟར་དྲི་མེད་ཤ་སྟག་ཡིན། །
en: “There will be eight consecutive congregations, Each of them gathering billions of worthy ones Who are all stainless like the currents of the Gaṅgā.
